> 🔎 직접 찾아보고 하나하나 이해하면서 정리해봤다. 신입 교육

-	**[보안]	SIEM**
**연동된 시스템과 다양한 장비의 모든 데이터를 수집하고 실시간 연관분석을 수행한다.** 분산처리 기법으로 데이터의 양에 한계 없이 수집하고 저장하고 분석 할 수 있다. 빠른 검색속도는 결과를 신속하게 도출한다.

-	**[보안]	SIM**
eyeCloudSIM은 연동된 시스템과 다양한 장비의 **모든 데이터를 수집하고 실시간 연관분석을 수행**합니다.	

-	**[보안]	SEM**
'검색 도구'를 단순한 검색 뿐만 아니라 적극적으로 특정 웹사이트로 방문을 유도하여 상품을 구입하게 하는 인터넷 마케팅 전략이다.	

-	**[보안]	ESM(통합보안관리)**
EnterpriseSecurityManage 통합보안관리는 전산환경의 장애발생시 중앙에서 **원격으로 통제**하여 처리 및 조치를 취할 수 있도록 전산환경의 성능, 보안의 취약성을 종합 관리하여 시스템의 안전성을 높여주는 시스템이다.

-	**[보안]	SOAR**
**보안 위협별로 표준화된 대응 프로세스**에 따라 기계와 사람의 유기적인 협업을 실현하여 관제 업무의 효율을 극대화하는 솔루션이다. **위협 이벤트 발생 시 차단, 분석 등의 업무를 상당 부분 자동화 처리한다.**

-	**[보안]	SOC**
전체 시스템을 칩 하나에 담은 기술집약적 반도체	

-	**[개발]  BigData**
일반적인 데이터베이스, 소프트웨어로 관리가 어려운 대용량의 데이터를 의미하며, 최근에는 **대용량 데이터의 수집, 저장, 플랫폼, 분석 기법** 등을 포괄하는 용어로 변화하고 있다.

-	**[개발]  정형 데이터**
데이터베이스의 정해진 규칙에 맞게 데이터를 들어간 데이터 중에 **수치 만으로 의미 파악이 쉬운 데이터**(Gender 컬럼이 있는데 male, female이라는 값이 들어간다면 누가 봐도 의미를 알 수 있다.)

-	**[개발]	비정형 데이터**
흔히, **텍스트, 음성, 영상**과 같은 데이터가 비정형 데이터 범위에 속해있다.	

-	**[개발]  반정형 데이터**
약한 정형 데이터를 말한다. 대표적으로 HTML이나 XML과 같은 포맷을 반정형 데이터의 범위에 넣을 수 있을 것이다.

-	**[개발]	DashBoard**
**시각화를 사용하여 스토리를 전달하는 단일 페이지**로, 캔버스라고도 한다.가장 중요한 요소만을 포함해야한다.

-	**[보안]	DDos**	
**다수의 악의적인 사용자가 특정 사이트에 동시에 접속하여 과도한 트래픽을 일으켜** 정상적인 서비스를 방해하는 크래킹의 일종이다.

-	**[보안]	audit**
컴퓨터 보안 시스템에서 시스템 자원 사용에 대하여 시간 순서에 따라 기록된 사용 내역 & 로그인, 파일 접근, 활동 내역, 보안 위반 사항이 합법적인지 여부 == 감사	

-	**[보안]	ssl**
SecureSocketLayer, **브라우저와 서버간의 통신에서 정보를 암호화** 함으로써 도중에 해킹을 통해 정보가 유출 되더라도 정보의 내용을 보호할 수 있게 해주는 보안솔루션이다.
("https://를 사용"  마지막 s는 보안 Secure 을 나타낸다.)

- **[보안]  threat**
손실이나 손상의 원인이 될 가능성의 제공하는 환경을 말한다. 예를 들면 취약점, 해커의 존재, 공격 대상이 될 수 있는 중요 자산등이 있다.

-	**[보안]	TI - ThreatIntelligence**
**위협 인텔리전스**는 현재 존재하거나 발생이 임박한 위협에 대한 증거 기반의 지식이며, 위협 대응에 관한 결정사항을 알려줄 수 있어야 한다.	

-	**[보안]	IDS - 침입 탐지 시스템**
**외부에서 내부로 들어오는 패킷이 정상인지 아닌지를 탐지하는 네트워크계의 CCTV** 같은 솔루션이다. 여기서 차단 기능이 더해지면 IPS이다.

-	**[보안]	IPS**
비정상 행위 및 악용을 탐지하는 네트워크계의 CCTV ! **차단기능**까지 포함되어있다.	

-	**[보안] parser**
**Parsing을 수행하는 프로그램**이다. Compiler의 일부로 컴파일러나 인터프리터에서 원시 프로그램을 읽어 들여 그 문장의 구조를 알아내는 Parsing(구문 분석)을 행하는 프로그램이다.	

-	**[보안]	Parsing**
**어떤 페이지(문서, html 등)에서 원하는 데이터를 특정 패턴이나 순서로 추출하여 정보로 가공**하는 것을 말합니다. 다이아몬드가 많이 나오는 위치로 이동을 한 후에 돌을 캐고 다이아몬드만 쏙쏙 뽑아서 보석으로 가공하는 과정하고 비슷하다고 보면 됩니다.

-	**[보안]	console**
실시간으로 자바스크립트를 실행하고, 에러 메시지등을 출력해주는 기능이다.

-	**[보안]	log**
**시간 순으로 정렬된 레코드의 집합체**이며, 추가만 가능하다. 특히 보안솔루션에있어서 가장 중요한 것 중 하나다.

-	**[보안]  Terminal**
터미널이란 컴퓨터와 사용자간의 서로 소통시켜주는 인터페이스라고 할 수 있다.

-	**[보안]	RAW DATA**
**원시 데이터**는 수동 또는 자동 컴퓨터 소프트웨어를 통해 철저한 처리를 거치지 않은 모든 데이터 개체를 말한다. 원시 데이터 == 소스 데이터, 기본 데이터 == 원자 데이터	

-	**[보안]	HA(High Availability)**
고 가용성. HA란 바람직한 정도로 긴 시간동안 **지속적으로 운영이 가능한 시스템이나 컴포넌트**를 가리킨다.

-	**[보안]	서버 사이드**
백엔드에서 서버 동작을 정의하기 위한 언어이다.	

-	**[보안]	IDE - 통합개발환경**
**코딩, 디버그, 컴파일, 배포 등 프로그램 개발에 관련된 모든 작업을 하나의 프로그램 안에서** 처리하는 환경을 제공하는 소프트웨어이다. 대표적인 예로, VSCODE, ECLIPSE를 들 수 있다.

-	**[보안]	가비지 컬렉션(GC)**
시스템에서 **더 이상 사용하지 않는 동적 할당된 메모리 블럭 혹은 개체를 찾아 자동으로 다시 사용 가능한 자원으로 회수**하는 것을 말한다.	

-	**[보안]	cloud**
**클라우드 서비스란 타사 제공업체가 호스팅하여 인터넷을 통해 사용자에게 제공하는 인프라, 플랫폼 또는 소프트웨어**를 말한다. 또한 사용자 데이터 흐름을 원활하게 해준다.	

-	**[보안]	애플리케이션**
특정 목적을 위해 작업을 수행하도록 설계된 하나 이상의 프로그램을 말한다.
 
-	**[보안]	CERT**
**'침해사고대응팀'**에서는 인터넷망의 트래픽 이상 유무를 24시간 관찰하고 신종 바이러스 및 해킹 동향을 수집, 분석하고, 예/경보 발령을 통해 침해사고에 신속히 대응하는 임무를 수행하는 곳이다.

-	**[보안]	integrity - 무결성**
무결성이란 **데이터베이스에서 저장된 값들에 대하여 여러가지 제한을 통하여 데이터에 대한 신뢰를 보장하게 하여 일관성을 유지시켜주는 것**입니다.	

-	**[보안]	머신 러닝 (Machine Learning)**
기계 학습 또는 머신 러닝은 인공 지능의 한 분야로, **컴퓨터가 학습할 수 있도록 하는 알고리즘과 기술을 개발**하는 분야를 말한다.

-	**[보안]	암호화**
어떠한 데이터를 암호화 시켜 다른 이들이 직접 그 의미를 알지 못하도록 하는 작업이다.	

-	**[보안]	복호화**
암호해독을 복호화라고한다. 복호화를 해야지만 암호화가 된 데이터를 우리가 알 수 있게 되는 것이다.	

-	**[보안]	해싱 (빠른 탐색 알고리즘)**
해싱은 **키에 산술적인 연산을 적용하여 항목이 저장되어 있는 테이블의 주소를 계산하여 항목에 접근**한다.

-	**[보안]	스위치**
스위치는 소규모 비즈니스 **네트워크 안에서 컴퓨터, 프린터, 서버 등 모든 디바이스를 서로 연결**함으로써 리소스를 쉽게 공유할 수 있도록 합니다. 스위치 덕분에 이러한 연결된 디바이스들은 건물 안이건 캠퍼스 안이건 관계없이 정보를 공유하고 서로 간에 통신할 수 있습니다.

-	**[보안]	라우터**	
스위치가 여러 디바이스를 연결하여 네트워크를 만들듯이, **라우터는 여러 스위치 그리고 각각의 네트워크들을 연결하여 더 큰 네트워크를 형성**합니다.

-	**[보안]	L4**
L4에서는 4 레이어의 프로토콜인 TCP/UDP 등에서 스위칭을 수행하므로 TCP와 UDP 등의 헤더를 보고 그것이 FTP 인가 HTTP 인가 SMTP 인가를 보고 어떤 것을 우선시해서 스위칭할지 판단할 수 있다. cf. TP(파일) SMTP(메일) Telnet(원격지원)

-	**[보안]	IP - InternetProtocol**
TCP는 데이터를 일정한 크기로 분할하고, IP는 TCP가 분할한 데이터에 송신처를 붙여서 네트워크로 보낸다. 약자로 **각각의 pc마다 고유 주소**를 가지고 있다. 이것을 IP주소라고 한다.

-	**[보안]	PORT**
포트는 항구다! , **IP주소는 컴퓨터를 찾을 때 필요한 주소**를 나타내며, **포트는 컴퓨터 안에서 프로그램을 찾을 때**를 나타내는 것이다.

-	**[보안]	API**
쉽게 정리하면 **API는 프로그램과 또 다른 프로그램을 연결해주는 일종의 다리**라고 볼 수 있다. 결제, 지도, 일기예보의 기능들을 제공할만한 기반이 되는 데이터도 없고 관련 프로그램이 없어서 API를 이용해야만 한다.**(사용자로부터 Request -> 결과값 받아 Parsing)**

-	**[보안]	REST**
Server - Client 명확히 구분된다! 종류는 GET, POST, PUT, DELETE가 있다. == 아키텍처

-	**[개발]	RESTful**
여긴 REST API 제공합니까 ? 네.라고 할 수 있다면 RESTful	

-	**[개발]	OAuth**
인터넷 사용자들이 **비밀번호를 제공하지 않고** 다른 웹사이트 상의 자신들의 정보에 대해 웹사이트나 애플리케이션의 접근 권한을 부여할 수 있는 공통적인 수단으로서 사용되는, **접근 위임**을 위한 개방형 표준이다.	

-	**[보안]	인증**
IT 제품의 보안 기능성과 평가 과정에서 그 제품들에 적용되는 보증수단에 대한 공통의 요구 사항들을 제시함으로써, 독립적으로 수행된 보안성 평가의 결과들을 비교할 수 있도록 한다.	

-	**[보안]	방화벽**
인터넷 접속 시 **외부 네트워크로부터의 액세스에 대해 보안을 확보하기 위해 특정한 액세스를 제한하는 소프트웨어**를 말한다.
	
-	**[인공지능]  AI**
빅데이터 시스템과 외부 위협 정보 등으로부터 수집된 **보안 정보를 취합**하고, **사용자가 지정하는 알고리즘과 학습 방법으로 필요한 모델을 생성**합니다.

- **[인공지능]  라벨링**
머신러닝, **특히 컴퓨터에게 정답(Labeling)을 알려주며 학습시키는 지도학습**을 위한 데이터 전처리의 중요한 부분이다. 즉, 비정형 데이터를 컴퓨터가 알아들을 수 있도록 변형하거나 가공하는 것이 데이터라벨링이다.	

-	**[인공지능]  딥러닝**
대규모 인공 신경망에 학습 알고리즘과 계속 증가하는 데이터를 공급함으로써 "사고"능력과 "학습"능력을 지속적으로 개선합니다. **자체 훈련과 독립적인 "학습"이 가능한 신경망을 구축**하는 것이 목표입니다.	

-	**[보안]	해킹**
다른 사람의 컴퓨터 시스템에 무단으로 침입하여 데이터와 프로그램을 없애거나 망치는 일.

-	**[개발]	트리거**
**특정 테이블에 INSERT, DELETE, UPDATE 같은 DML문이 수행되었을 때, 데이터베이스에서 자동으로 동작하도록 작성된 프로그램**입니다. 즉! 사용자가 직접 호출하는 것이 아니라, DB에서 자동적으로 호출하는 것이다.	

-	**[개발]	객체지향***
**객체의 성질들을 코드상으로 구현**하게 된다면 이게 객체지향 프로그래밍이다. 클래스 + 인스턴스(객체), 캡슐화, 다형성, 상속성, 추상화 개념이 존재한다.	건달==객체 // 조직폭력배==클래스

-	**[개발]	클로저**
내부함수가 외부함수의 지역변수에 접근 할 수 있고, 외부함수는 외부함수의 지역변수를 사용하는 내부함수가 소멸될 때까지 소멸되지 않는 특성을 의미한다.	

-	**[개발]	함수형**
선언형이며, 애플리케이션의 상태는 순수한 함수를 통해 전달된다. 순수함수란 하나 이상의 인자를 받고, 받은 인자를 처리하여 반드시 결과물을 돌려주어야 한다는 것이다. 인자(Argument)는 어떤함수 호출시 전달되는 값	

-	**[개발]	프로토타입**
모든 객체가 공통적으로 가지고 있는 속성이다. 객체가 생성되면 자동으로 그 객체는 prototype이라는 속성을 갖는다. 또한, 객체에 prototype에 값이 추가되거나 변경되면 같은 형태의 객체들도 똑같은 값을 갖는다.

-	**[개발]	호이스팅**
**모든 선언(var, let, const, function 등)을 가장 위로 끌어올린다.** 전역 범위에서는 스크립트 단위에서 최상단으로 끌어 올려지며, 함수 범위에서는 해당 함수의 최상단으로 끌어 올려진다. '선언'만 끌어 올려진다.	

- **[빅데이터]  lucene**
**정보검색 라이브러리**이다. 사용자는 루씬 라이브러리를 사용해서 검색서비스, 어플리케이션을 구현해야하는 것이다. 색인과 검색기능을 간단히 추가할 수 있다.

- **[개발] hash**
데이터의 무결성을 검증하기 위해 사용한다. 최초 hash 값과 비교해서 hash 값이 다르면 데이터가 변조되었다고 판단된다. **해시를 사용하면 특정데이터를 짧은 길이의 유니크한 데이터값으로 반환해준다.**

- **[개발] DB INDEX**
쓰기 작업과 저장 공간을 활용하여 데이터베이스 **테이블의 검색 속도를 향상시키기 위한 자료구조**이다. 인덱스를 사용안하면 Full Scan을 수행하므로 비교적 속도가 떨어진다. 단, 저장공간 10%, 추가소스작업필요하다.

- **[개발] DB Optimizer**
 **SQL로 요구된 결과를 최소의 비용으로 처리할 수 있는 처리 경로를 결정한다.** 방법은 규칙기반(액세스 경로별 우선순위) / 비용기반(쿼리를 수행하는데 소요되는 일량 또는 시간)이 있다.
 
- **[보안] AES**
 **고급 암호화 표준(Advanced Encryption Standard)은 암호화와 복호화 과정에서 동일한 키를 사용하는 대칭 키 알고리즘이다.** 또한 미 국가안보국에 의해 1급기밀에 사용할수 있게 승인된 알고리즘 중 최초로 공개됐다.
 
- **[보안] SHA**
 HASH의 암호화 모델이다. 안전한 해시 알고리즘이다. 즉, 서버(홈페이지)와 클라이언트(사용자)가 데이터를 주고받을 때 중간에 훔쳐볼 수 없도록 통신 데이터를 암호화하는 기술이다.

- **[개발] heap**
**우선순위 큐를 위해 만들어진 자료구조**이며, 최댓값이나 최솟값을 빠르게 찾아낼 수 있다.중복값을 허용한다.

- **[보안] 보안관제**
 해킹이나 위협 등으로 부터 자원 손상을 막기 위해 대응하는 행위를 하는 사람들을 보안 관제라 한다. 모든 시스템을 실시간으로 모니터링하여 즉각 대응하는 것이다.
 
- **[개발] Proxy**
인터넷에서 유저를 대신해서 데이터를 가져오는 서버다. '**대리**'=='중계인'==프록시이다. 클라이언트 naver.com 입력 -> 서버로 X 프록시서버 O -> 프록시서버가 네이버서버로가서 클라이언트에게 전달한다.

- **[개발] HTTP 통신**
HyperTextTransferProtocol이란 한마디로 HTML(웹문서를 만들기 위한 언어)문서를 주고 받는데 쓰이는 **통신프로토콜(통신규약)**이며, TCP(전화) 와 UDP(쪽지) 를 사용하여 통신하며 80번 포트를 사용하는 통신프로토콜이다.

- **[개발] HTTPS**
http와 거의 같지만 모든 통신 내용을 암호화를 할 수 있다. 즉 Secure Socket이다. 단점은 인터넷 연결이 끊기면 소켓도 끊어져서 다시 인증을 해야하며, 비용이 많이 든다.

- **[개발] HTML5** 
Client Side Technology 기술이 중심이 되는 마크업 언어이다. **HTML과 다르게 클라이언트와 서버와의 통신이 가능**하며 다른 외부 Active-X / plug-ins를 사용하지 않고도 웹 서비스를 제공할 수 있을 정도로 많은 기능 추가

- **[개발] middleware**
**양 쪽을 연결하여 데이터를 주고받을 수 있도록 중간에서 매개 역할을 하는 소프트웨어**, 네트워크를 통해서 연결된 여러 개의 컴퓨터에 있는 많은 프로세스들에게 어떤 서비스를 사용할 수 있도록 연결해주는 소프트웨어이다.

- **[개발] 라이센스**
권리자만이 소프트웨어를 사용, 복제, 배포, 수정할 수 있다. 다른사람에게 일정한 내용을 조건으로 특정 행위를 할 수 있는 권한을 부여할 필요가 있는데, 이와 같은 권한을 라이센스(이용허락권)이라고 한다.

- **[개발] GIT**
SVN(중앙 서버에서 src와 history를 저장)과 마찬가지로 Git은 소스코드를 관리하기 위한 소프트웨어다. 특징은 분산형 관리 시스템이라는 점으로 다양한 형태의 Workflow를 가능하게 한다. (중앙저장소 / 로컬저장소)

- **[개발] WAS**
DB 조회나 다양한 로직 처리를 요구하는 동적인 컨텐츠를 제공하기 위해 만들어진 Application Server. “웹 컨테이너(Web Container)” 혹은 “서블릿 컨테이너(Servlet Container)”라고도 불린다.
Container란 JSP, Servlet을 실행시킬 수 있는 소프트웨어를 말한다.
즉, WAS는 JSP, Servlet 구동 환경을 제공한다.

- **[개발] WebServer**
Web Server의 개념은 소프트웨어와 하드웨어로 구분된다.
1) 하드웨어
Web 서버가 설치되어 있는 컴퓨터
2) 소프트웨어
웹 브라우저 클라이언트로부터 HTTP 요청을 받아 정적인 컨텐츠(.html .jpeg .css 등)를 제공하는 컴퓨터 프로그램

- **[개발] RDBMS**
DB의 레코드들을 삽입, 삭제, 수정, 탐색 할 수 있도록 해주는 소프트웨어이다. 가장 대중적으로 사용되는 DBMS이다.

- **[개발] 디자인패턴**
디자인 패턴이란 프로그래밍 할때에 문제를 해결하고자 코드의 구조들을 일정한 형태로 만들어 
재이용하기 편리하게 만든 일정한 패턴이라고 생각하시면 됩니다.

- **[개발] graphDB**
NoSQL에 속하며, 개별 객체의 데이터를 나타내는 점, 성질이 비슷한 객체들의 묶음, 객체 간의 관계를 표시하는 선으로 이루어져 있다.

- **[개발] 도메인**
IP 주소는 숫자라 사람이 기억하고 있기에 너무 어려웠다. 그래서 생겨난게 도메인이다. 문자 형태의 주소체계

- **[개발] DDD**
DDD(Domain Driven Design), 
도메인 주도 디자인이란 개발을 함에 있어 도메인이 중심이 되는 개발 방식을 말하며,  소프트웨어의 연관된 부분들을 연결하여 계속 해서 진화하는 새로운 모델을 만들어 복잡한 App을 만드는 것을 쉽게 해주는 것에 있다.

- **[보안] 리버싱**
소프트웨어 분야에서 해당 프로그램의 구조, 기능, 동작 등의 원리를 역으로 따라가며 이해하고 분석하여 부족한 부분이 있거나 추가 되었으면 하는 새로운 기능 등을 추가하는 전체적 행위입니다.

- **[보안] MD5**
128비트 암호화 해시 함수로 주로 프로그램이나 파일이 원본 그대로인지를 확인하는 무결성 검사 등에 사용되는 암호화의 한 종류 입니다. 하지만 보안상 결함이 많다.

- **[개발] dump**
기억 장치의 내용을 출력하는 일. 전체 백업할 때 사용한다.

- **[개발] engine**
다른 프로그램들을 위해 핵심적이고 본질적인 기능을 수행해주는 프로그램을 지칭한다. 주로 **인공지능 분야에서 사용되고, 지식베이스로부터 결과를 도출하기 위해 논리 규칙을 사용하여 '추론엔진'이라 부른다.**

- **[개발] stand-alone**
다중의 클라이언트를 받아들이기 위해서 fork, select poll, thread등을 프로그래밍 기법을 사용한다. 소켓 생성부터 데이터 처리까지 모든 기능을 혼자 수행하는 네트워크 프로그램을 stand alone 방식 프로그램이라 한다.

- **[개발] www**
WorldWideWeb의 약자로 인터넷에 연결된 컴퓨터를 이용해 사람들과 정보를 공유할 수 있는 공간이다.

- **[개발] URL**
URI의 가장 흔한 형태이다. 특정 서버의 한 리소스에 대한 구체적인 위치를 서술한다. 1. 스킴 : 리소스에 접근하기 위한 프로토콜 (https://) 2. 인터넷 주소 : velog.io 3. 웹 서버의 리소스 : /@lzhxxn

- **[개발] URI**
하나의 고유한 리소스를 대표하도록 설계된다는 개념, HTTP는 주어진 URI로 객체를 찾아온다. 두 가지가 있는데 URL과 URN이다

- **[개발] AJAX**
비동기 자바스크립트와 XML(Asynchronous JavaScript And XML)을 말한다. 즉 서버와 통신하기 위해 XMLHttpRequest 객체를 사용하는 것을 말한다.

- **[개발] HTML**
HyperText Markup Language 홈페이지, 웹사이트의 컨텐츠이다. 웹페이지를 만들기 위한 언어로 웹브라우저 위에서 동작하는 언어이다.

- **[개발] JSP(Java Server Pages)**
HTML을 코딩하기 너무 어렵고 불편해서** HTML 내부에 Java코드를 삽입하는 형식이 JSP이다.** 다시 말해 서블릿의 단점을 보완하고자 만든 서블릿 기반의 스크립트 기술이다.

- **[개발] JS(JavaScript)**
HTML / CSS로 만들어진 웹페이지를 **동적으로** 변경해주는 언어이다. 

- **[개발] JQuery**
JavaScript의 생산성을 향상시켜주는 JavaScript 라이브러리이다. (라이브러리 : 자주 사용하는 코드들을 재사용할 수 있는 형태로 가공해서 프로그래밍 효율을 높여주는 코드들이다.)
```<head>
<script>
$(function(){
});
</script>
</head>
```

- **[개발] Frontend**
유저들에게 보여지는 화면을 구성하는 부분을 의미한다. 클라이언트가 원하는 기능을 수행할 수 있게 지원하는 부분이다.

- **[개발] Backend**
백엔드 개발자는 보이지 않는 곳에서 작동하는 코드를 만든다. 서버, 프로그램 기능 등의 영역을 의미한다. 

- **[개발] Maven**
**의존성 관리를 이용하여 쉽게 오픈소스 라이브러리들의 의존성을 관리할 수 있다.** 의존 라이브러리를 pom.xml 파일을 통하여 관리한다. 기본 위치는 .m2 디렉터리에 저장된다.

- **[개발] SVN**
소스 관리 툴이다. 가장 빈번히 쓰이는 명령어는 Update, Commit이다. SVN서버의 저장소란 영역에 저장된다.

- **[개발] 형상관리**
소스의 변화를 끊임없이 관리하는 것을 말한다.

- **[IT상식] SI**
SysIntegration(시스템 구축)의 약자로 전산시스템을 필요로 하는 곳으로부터 하청을 받아, 시스템의 기획/개발/유지보수/운영 등을 대신 해주는 업종이다. 주로 제안서 작성/ PM과 개발자를 투입하여 프로젝트를 수행한다.

- **[IT상식] SM**
시스템 운영, 유지보수의 약자. 시스템 기능상 오류가 발생하거나, 기능 변경을 주로한다.

- **[IT상식] 솔루션**
미리 만들어놓은 제품을 요구사항에 맞게 수정하는 직군이다. SI와 상당히 비슷한 특성을 가지고 있으며, 고객이 필요로 하는 프로그램을 프로젝트 단위의 작업으로 구성하여 제공한다는 것이다.

- **[개발] WBS**
Work Breakdown Structure의 약자로, 프로젝트 관리 및 시스템 엔지니어링에서 프로젝트를 소규모의 구성 단위까지 나누어 전달할 수 있는 기능을 말한다. 즉 프로젝트의 전체 일정수립 및 관리문서라고 할 수 있다.

- **[IT상식] 가용성**
시스템이 서비스를 정상적으로 제공할 수 있는 상태, 즉, 항상 서비스할 수 있는 시스템을 가용성이 높은 시스템이라고 한다.

- **[IT상식] 패킷** 
다양한 데이터의 내용을 작은 단위로 쪼갠 데이터이다. 
